app/Controllers/ProjectControllers/Auth.php

    public function authenticate()
    {
        $session = session();
        $userModel = new User();

        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');

        $user = $userModel->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'abhi@gmail.com'
 LIMIT 1