app/Controllers/ProjectControllers/Dashboard.php

SELECT *
FROM `users`
WHERE `users`.`id` = '1'
---
    public function profile()
    {
        $session = session();
        if (!$session->get('logged_in')) {
            return redirect()->to('project/login');
        }

        $userModel = new User();
        $user = $userModel->find($session->get('id'));