app/Controllers/ProjectControllers/Reservation.php

    public function index()
    {
        $session = session();
        if (!$session->get('logged_in')) {
            return redirect()->to('project/login');
        }

        $reservationModel = new ReservationModel();
        $reservations = $reservationModel->where('user_id', $session->get('id'))->findAll();
---
SELECT *
FROM `reservations`
WHERE `user_id` = '1'

    public function store()
    {
        $session = session();
        if (!$session->get('logged_in')) {
            return redirect()->to('project/login');
        }

        $reservationModel = new ReservationModel();

        $data = [
            'user_id'           => $session->get('id'),
            'train_number'      => $this->request->getVar('train_number'),
            'departure_station' => $this->request->getVar('departure_station'),
            'arrival_station'   => $this->request->getVar('arrival_station'),
            'departure_date'    => $this->request->getVar('departure_date'),
            'seat_number'       => $this->request->getVar('seat_number'),
        ];

        $reservationModel->save($data);
---
INSERT INTO `reservations` (`user_id`, `train_number`, `departure_station`, `arrival_station`, `departure_date`, `seat_number`, `created_at`, `updated_at`) VALUES ('1', '08815', 'Durg', 'Antagarh', '2024-06-16', '65', '2024-06-15 18:00:32', '2024-06-15 18:00:32')

    public function view($id)
    {
        $session = session();
        if (!$session->get('logged_in')) {
            return redirect()->to('project/login');
        }

        $reservationModel = new ReservationModel();
        $reservation = $reservationModel->find($id);
---
SELECT *
FROM `reservations`
WHERE `reservations`.`id` = '4'